CSI API ETABS v1
cAutoSeismic Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cAutoSeismic
Public Interface cAutoSeismic
Dim instance As cAutoSeismic
public interface class cAutoSeismic
type cAutoSeismic =  interface end
The cAutoSeismic type exposes the following members.
Methods
Name | Description
GetASCE716
 Retrieves auto seismic loading parameters for the 2016 ASCE 7 code
GetASCE716_1
 Retrieves auto seismic loading parameters for the 2016 ASCE 7 code
GetIBC2006
SetASCE716
 Defines auto seismic loading parameters for the 2016 ASCE 7 code
SetASCE716_1
 Defines auto seismic loading parameters for the 2016 ASCE 7 code
SetIBC2006
Top
See Also
Reference
ETABSv1 Namespace